/****************************************************************
 *
 *                              遗漏接口服务
 *
 ****************************************************************/
'use strict';

import { BaseService } from '../public/base.service';
import DealWithCommonService from  '../public/dealWithCommon.service';

export class OmissionService extends BaseService {

    constructor() {

        super();

        this.chartPath                = '/miss';
    }

    /** 根据_flot 、lotterycode 获取图表名称 */
    getFlotName(_data,_flotType,_queryDay){

        for (var i = 0; i < _data.length; i++) {
            for (var m = 0; m < _data[i].child.length; m++) {
                if(_flotType == _data[i].child[m].code){
                    if(_queryDay!=undefined){
                        if(_data[i].child[m].queryDay==_queryDay){
                            return _data[i].child[m].name;
                            break;
                        }
                    }else{
                        return _data[i].child[m].name;
                        break;
                    }
                }
            }
        }
        return "";
    }

    /**
     *   遗漏图表方法
     */
    getMissStatData(_lotterycode, _flotType, _quantity, _sort){


        if(_lotterycode == undefined || typeof(_lotterycode) !='string'){
            return this.errorMsg(`getMissStatData: _lotterycode参数为空或不是字符串类型！`);
        }

        if(_flotType == undefined || typeof(_flotType) !='number'){
            return this.errorMsg(`getMissStatData: _flotType参数为空或不是数字类型！`);
        }

        if(_quantity == undefined){
            _quantity = 500
        }

        let _flotArr;


       /**  数字彩 */
      if(_lotterycode == 'ssq'){

          /**
           红球基本 = 11,	                 11
           红球大小 = 12,	                 12
           红球奇偶 = 13,	                 13
           红球质合 = 14,	                 14
           红球和值 = 15,	                 15
           红球跨度 = 16,	                 16
           红球二连号 = 17,	             17
           红球除三余0个数 = 18,	    18
           红球除三余1个数 = 19,	    19
           红球除三余2个数 = 20,	    20
           红球012路比 = 21,	        21
           红球七区二行 = 22,	        22
           红球七区二列 = 23,	        23
           红球六区二行 = 24,	        24
           红球六区二列 = 25,	        25

           蓝球基本 = 51	                51
           */
          _flotArr = [11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,51];

      }else if(_lotterycode == 'fc3d'){


          /**
           *   定位个位 = 11,
               定位十位 = 12,
               定位百位 = 13,

               直选单式 = 21,
               直选大小 = 22,
               直选奇偶 = 23,
               直选质合 = 24,
               直选跨度 = 25,
               直选和值 = 26,
               直选和尾 = 27,

               组三单式 = 31,
               组三一码 = 32,
               组三二码 = 33,
               组三三码 = 34,
               组三四码 = 35,
               组三五码 = 36,
               组三六码 = 37,
               组三七码 = 38,
               组三八码 = 39,
               组三九码 = 40,
               组三和值 = 41,

               组六三码 = 51,
               组六四码 = 52,
               组六五码 = 53,
               组六六码 = 54,
               组六七码 = 55,
               组六八码 = 56,
               组六和值 = 57,

               其它组选1码 = 61,
               其它组选2码 = 62,
               其它个位十位 = 63,
               其它个位百位 = 64,
               其它十位百位 = 65,
               其它组选 = 66,
               其它和值大小 = 67,
               其它拖拉机 = 68
           */
          _flotArr = [11,12,13,21,22,23,24,25,26,27,31,32,33,34,35,36,37,38,39,40,41,51,52,53,54,55,56,57,61,62,63,64,65,66,67,68,69];


      }else if(_lotterycode == 'dlt'){

          /**
           前区号码 = 11,	        11
           前区大小比 = 12,	    12
           前区奇偶比 = 13,	    13
           前区质合比 = 14,	    14
           前区和值 = 15,	        15
           前区跨度 = 16,	        16
           前区012路比 = 17,	    17
           前区七区二行 = 18,	    18
           前区七区二列 = 19,	    19
           前区六区二行 = 20,	    20
           前区六区二列 = 21,	    21

           后区号码 = 51,	    51
           后区二码 = 52,	    52
           后区三码 = 53,	    53
           后区和值 = 54,	    54
           后区跨度 = 55	    55
           */
          _flotArr = [11,12,13,14,15,16,17,18,19,20,21,51,52,53,54,55];

      }else if(_lotterycode == 'pl3'){

          /**
           *   排列3和福彩3d是一样的;
           */
          _flotArr = [11,12,13,21,22,23,24,25,26,27,31,32,33,34,35,36,37,38,39,40,41,51,52,53,54,55,56,57,61,62,63,64,65,66,67,68,69];

      }else if(_lotterycode == 'pl5'){

          /**
           *  定位个位 = 11,	    11
               定位十位 = 12,	    12
               定位百位 = 13,	    13
               定位千位 = 14,	    14
               定位万位 = 15,	    15

               形态大小比    = 21,	        21
               形态奇偶比    = 22,	        22
               形态质合比    = 23,	        23
               形态和值       = 24,	        24
               形态跨度       = 25,	        25
               形态012路比 = 26	        26
           */
          _flotArr = [11,12,13,14,15,21,22,23,24,25,26];


      }else if(_lotterycode == 'qlc'){

          /**
               基本号码 = 11,	    11

               形态奇偶比    = 21,	    21
               形态大小比    = 22,	    22
               形态质合比    = 23,	    23
               形态012路比 = 24	    24
               形态和值       = 25	    25
           */
          _flotArr = [11,21,22,23,24,25];


      }else if(_lotterycode == 'qxc'){

          /**
               定位第一位 = 11,	    11
               定位第二位 = 12,	    12
               定位第三位 = 13,	    13
               定位第四位 = 14,	    14
               定位第五位 = 15,	    15
               定位第六位 = 16,	    16
               定位第七位 = 17,	    17

               形态大小比 = 21,	    21
               形态奇偶比 = 22,	    22
               形态质合比 = 23,	    23
               形态和值 = 24,	        24
               形态跨度 = 25,	        25
               形态012路比 = 26	    26
           */
          _flotArr = [11,12,13,14,15,16,17,20,21,22,23,24,25,26];

     /**  高频彩 */
      }else{

          if(/k3/.test(_lotterycode)){

              /**
               基本一码 = 11,
               基本二码 = 12,
               基本和值 = 13,
               基本跨度 = 14,
               基本三同号012路 = 15,

               二同号单选 = 20,
               二同号二码 = 21,
               二同号三码 = 22,
               二同号二组 = 23,
               二同号三组 = 24,
               二同号和值 = 25,
               二同号跨度 = 26,
               二同号背靠背 = 27,
               二同号形态    = 28,
               二同号单选012路 = 29,

               三不同号单选 = 31,
               三不同号四码 = 32,
               三不同号五码 = 33,
               三不同号和值 = 34,
               三不同号跨度 = 35,
               三不同号012路 = 36,
               三不同号二组 = 37,
               三不同号三组 = 38,

               三同号单选 = 41,
               三同号二组 = 42,
               三同号三组 = 43,
               三同号四组 = 44,
               三同号五组 = 45,
               三同号通选 = 46
               */
              _flotArr = [11,12,13,14,15,20,21,22,23,24,25,26,27,28,29,31,32,33,34,35,36,37,38,41,42,43,44,45,46];

          }else if(/kl10/.test(_lotterycode) || _lotterycode=='xync'){



              if(_lotterycode == 'gxkl10'){

                  /**
                       基本一码 = 11,
                       基本二码 = 12,
                       基本三码 = 13,
                       基本四码 = 14,
                       基本五码 = 15,

                       形态大小比 = 21,
                       形态奇偶比 =22,
                       形态质合比 = 23,
                       形态012路 = 24

                   */

                  _flotArr = [11,12,13,14,15,21,22,23,24];

              }else{

                  /**
                   *   选一前一 = 11,

                   选二任选 = 21,
                   选二连组 = 22,
                   选二连直 = 23,

                   选三任选 = 31,
                   选三前组组选 = 32,
                   选三前组跨度 = 33,
                   选三前组和值 = 34,
                   选三前组大小比 = 35,
                   选三前组奇偶比 = 36,
                   选三前组质合比 = 37,
                   选三前组012路 = 38,
                   选三前直大小 = 39,
                   选三前直奇偶 = 40,
                   选三前直质合 = 41,
                   选三前直012路 = 42,

                   八码大小比 = 51,
                   八码奇偶比 = 52,
                   八码质合比 = 53,
                   八码012路 = 54,
                   八码跨度 = 55

                   */
                  _flotArr = [11,21,22,23,31,32,33,34,35,36,37,38,39,40,41,42,51,52,53,54,55];
              }


          }else if(/11x5/.test(_lotterycode)){

              /**
               *  任一一码 = 101,
                   任二二码 = 102,
                   任二三码 = 103,
                   任二四码 = 104,
                   任三三码 = 105,
                   任三四码 = 106,
                   任三五码 = 107,
                   任四四码 = 108,
                   任四五码 = 109,
                   任四六码 = 110,
                   任四七码 = 111,
                   任五五码 = 112,
                   任五六码 = 113,
                   任五七码 = 114,
                   任五八码 = 115,
                   任五九码 = 116,
                   任五跨度 = 117,
                   任五和值 = 118,
                   任五奇偶 = 119,
                   任五大小 = 120,
                   任五质合 = 121,
                   任五除三余数 = 122,
                   任五三连号 = 123,
                   任五四连号 = 124,
                   任五五连号 = 125,
                   任六六码 = 126,
                   任六七码 = 127,
                   任六八码 = 128,
                   任六九码 = 129,
                   任七七码 = 130,
                   任七八码 = 131,
                   任七九码 = 132,
                   任八八码 = 133,
                   任八九码 = 134,

                   前一直选号码 = 201,
                   前一直选奇偶 = 202,
                   前一直选大小 = 203,
                   前一直选质合 = 204,
                   前一直选012路 = 205,
                   前二直选号码 = 206,
                   前二直选跨度 = 207,
                   前二直选和值 = 208,
                   前二直选奇偶 = 209,
                   前二直选大小 = 210,
                   前二直选质合 = 211,
                   前二直选012路 = 212,
                   二三位直选号码 = 213,
                   二三位直选跨度 = 214,
                   二三位直选和值 = 215,
                   二三位直选奇偶 = 216,
                   二三位直选大小 = 217,
                   二三位直选质合 = 218,
                   二三位直选012路 = 219,
                   一三位直选号码 = 220,
                   一三位直选跨度 = 221,
                   一三位直选和值 = 222,
                   一三位直选奇偶 = 223,
                   一三位直选大小 = 224,
                   一三位直选质合 = 225,
                   一三位直选012路 = 226,
                   前三直选号码 = 227,
                   前三直选跨度 = 228,
                   前三直选和值 = 229,
                   前三直选奇偶 = 230,
                   前三直选大小 = 231,
                   前三直选质合 = 232,
                   前三直选012路 = 233,


                   前二组选二码 = 301,
                   前二组选三码 = 302,
                   前二组选四码 = 303,
                   前二组选五码 = 304,
                   前二组选六码 = 305,
                   前二组选七码 = 306,
                   前二组选八码 = 307,
                   前二组选跨度 = 308,
                   前二组选和值 = 309,
                   前二组选奇偶比 = 310,
                   前二组选大小比 = 311,
                   前二组选质合比 = 312,
                   前二组选012路 = 313,
                   前三组选三码 = 314,
                   前三组选四码 = 315,
                   前三组选五码 = 316,
                   前三组选六码 = 317,
                   前三组选七码 = 318,
                   前三组选八码 = 319,
                   前三组选跨度 = 320,
                   前三组选和值 = 321,
                   前三组选奇偶比 = 322,
                   前三组选大小比 = 323,
                   前三组选质合比 = 324,
                   前三组选012路 = 325,

                   定位第一位号码 = 401,
                   定位第一位奇偶 = 402,
                   定位第一位大小 = 403,
                   定位第一位质合 = 404,
                   定位第一位012路 = 405,
                   定位第二位号码 = 406,
                   定位第二位奇偶 = 407,
                   定位第二位大小 = 408,
                   定位第二位质合 = 409,
                   定位第二位012路 = 410,
                   定位第三位号码 = 411,
                   定位第三位奇偶 = 412,
                   定位第三位大小 = 413,
                   定位第三位质合 = 414,
                   定位第三位012路 = 415,
                   定位第四位号码 = 416,
                   定位第四位奇偶 = 417,
                   定位第四位大小 = 418,
                   定位第四位质合 = 419,
                   定位第四位012路 = 420,
                   定位第五位号码 = 421,
                   定位第五位奇偶 = 422,
                   定位第五位大小 = 423,
                   定位第五位质合 = 424,
                   定位第五位012路 = 425
               */

              _flotArr = [
                  101,102,103,104,105,106,107,108,109,110,
                  111,112,113,114,115,116,117,118,119,120,
                  121,122,123,124,125,126,127,128,129,130,
                  131,132,133,134,201,202,203,204,205,206,
                  207,208,209,210,211,212,213,214,215,216,
                  217,218,219,220,221,222,223,224,225,226,
                  227,228,229,230,231,232,233,301,302,303,
                  304,305,306,307,308,309,310,311,312,313,
                  314,315,316,317,318,319,320,321,322,323,
                  324,325,401,402,403,404,405,406,407,408,
                  409,410,411,412,413,414,415,416,417,418,
                  419,420,421,422,423,424,425
              ];

          }else if(/ssc/.test(_lotterycode)){

              /**
               *  任一个位 = 11,
                   任一十位 = 12,
                   任一百位 = 13,
                   任一千位 = 14,
                   任一万位 = 15,
                   任二个十 = 16,
                   任二个百 = 17,
                   任二个千 = 18,
                   任二个万 = 19,
                   任二十百 = 20,
                   任二十千 = 21,
                   任二十万 = 22,
                   任二百千 = 23,
                   任二百万 = 24,
                   任二千万 = 25,

                   二星直选单式 = 51,
                   二星直选和值 = 52,
                   二星直选大小单双 = 53,
                   二星组选单式 = 54,
                   二星组选和值 = 55,
                   三星直选单式 = 56,
                   三星直选和值 = 57,
                   三星组三单式 = 58,
                   三星组三一码 = 59,
                   三星组三二码 = 60,
                   三星组三三码 = 61,
                   三星组三四码 = 62,
                   三星组三五码 = 63,
                   三星组三和值 = 64,
                   三星组三大小比 = 65,
                   三星组三奇偶比 = 66,
                   三星组三质合比 = 67,
                   三星组六单式 = 68,
                   三星组六四码 = 69,
                   三星组六五码 = 70,
                   三星组六和值 = 71,
                   三星组六大小比 = 72,
                   三星组六奇偶比 = 73,
                   三星组六质合比 = 74

               */

              _flotArr = [
                  11,12,13,14,15,16,17,18,19,20,
                  21,22,23,24,25,51,52,53,54,55,
                  56,57,58,59,60,61,62,63,64,65,
                  66,67,68,69,70,71,72,73,74
              ];

          }

      }



        if( _flotType==undefined || typeof(_flotType) != 'number' ||  DealWithCommonService.contains(_flotArr, _flotType)== false){



            return this.errorMsg(`getFlotMissData: _flotType参数为空或不是数字类型, 或者是取值范围不正确！`);

        }

        let  cacheOpt = this.setCache(`${this.chartPath}/getMissStatData`, 0);


        let  _parm;

        if(_sort){
            _parm = {
                flotType: _flotType,
                quantity: _quantity,
                lotterycode: _lotterycode,
                sort: _sort
            }
        }else{
            _parm = {
                flotType: _flotType,
                quantity: _quantity,
                lotterycode: _lotterycode
            }
        }

        const httpOpt = {
            url: `${this.chartPath}/GetMissStatData`,
            qs: _parm
        };

        return this.httpGet(httpOpt, cacheOpt);

  }


    /**
     *   循环周期/遗漏图表
     *
     */
    getMissFlotData(_lotterycode, _flotType,  _number, _type){


        if(_lotterycode == undefined || typeof(_lotterycode) !='string'){
            return this.errorMsg(`getFlotMissData: _lotterycode参数为空或不是字符串类型！`);
        }

        if(_flotType == undefined || typeof(_flotType) !='number'){
            return this.errorMsg(`getFlotMissData: _flotType参数为空或不是数字类型！`);
        }

        if(_number == undefined || typeof(_number) !='string'){
            return this.errorMsg(`getFlotMissData: _number参数为空或不是字符串类型！`);
        }

        if(_type == undefined || typeof(_type) !='number'){
            return this.errorMsg(`getFlotMissData: _type参数为空或不是数字类型！`);
        }

        let _flotArr;


        /**  数字彩 */
        if(_lotterycode == 'ssq'){

            /**
             红球基本 = 11,	                 11
             红球大小 = 12,	                 12
             红球奇偶 = 13,	                 13
             红球质合 = 14,	                 14
             红球和值 = 15,	                 15
             红球跨度 = 16,	                 16
             红球二连号 = 17,	             17
             红球除三余0个数 = 18,	    18
             红球除三余1个数 = 19,	    19
             红球除三余2个数 = 20,	    20
             红球012路比 = 21,	        21
             红球七区二行 = 22,	        22
             红球七区二列 = 23,	        23
             红球六区二行 = 24,	        24
             红球六区二列 = 25,	        25

             蓝球基本 = 51	                51
             */
            _flotArr = [11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,51];

        }else if(_lotterycode == 'fc3d'){


            /**
             *   定位个位 = 11,
             定位十位 = 12,
             定位百位 = 13,

             直选单式 = 21,
             直选大小 = 22,
             直选奇偶 = 23,
             直选质合 = 24,
             直选跨度 = 25,
             直选和值 = 26,
             直选和尾 = 27,

             组三单式 = 31,
             组三一码 = 32,
             组三二码 = 33,
             组三三码 = 34,
             组三四码 = 35,
             组三五码 = 36,
             组三六码 = 37,
             组三七码 = 38,
             组三八码 = 39,
             组三九码 = 40,
             组三和值 = 41,

             组六三码 = 51,
             组六四码 = 52,
             组六五码 = 53,
             组六六码 = 54,
             组六七码 = 55,
             组六八码 = 56,
             组六和值 = 57,

             其它组选1码 = 61,
             其它组选2码 = 62,
             其它个位十位 = 63,
             其它个位百位 = 64,
             其它十位百位 = 65,
             其它组选 = 66,
             其它和值大小 = 67,
             其它拖拉机 = 68
             */
            _flotArr = [11,12,13,21,22,23,24,25,26,27,31,32,33,34,35,36,37,38,39,40,41,51,52,53,54,55,56,57,61,62,63,64,65,66,67,68,69];


        }else if(_lotterycode == 'dlt'){

            /**
             前区号码 = 11,	        11
             前区大小比 = 12,	    12
             前区奇偶比 = 13,	    13
             前区质合比 = 14,	    14
             前区和值 = 15,	        15
             前区跨度 = 16,	        16
             前区012路比 = 17,	    17
             前区七区二行 = 18,	    18
             前区七区二列 = 19,	    19
             前区六区二行 = 20,	    20
             前区六区二列 = 21,	    21

             后区号码 = 51,	    51
             后区二码 = 52,	    52
             后区三码 = 53,	    53
             后区和值 = 54,	    54
             后区跨度 = 55	    55
             */
            _flotArr = [11,12,13,14,15,16,17,18,19,20,21,51,52,53,54,55];

        }else if(_lotterycode == 'pl3'){

            /**
             *   排列3和福彩3d是一样的;
             */
            _flotArr = [11,12,13,21,22,23,24,25,26,27,31,32,33,34,35,36,37,38,39,40,41,51,52,53,54,55,56,57,61,62,63,64,65,66,67,68,69];

        }else if(_lotterycode == 'pl5'){

            /**
             *  定位个位 = 11,	    11
             定位十位 = 12,	    12
             定位百位 = 13,	    13
             定位千位 = 14,	    14
             定位万位 = 15,	    15

             形态大小比    = 21,	        21
             形态奇偶比    = 22,	        22
             形态质合比    = 23,	        23
             形态和值       = 24,	        24
             形态跨度       = 25,	        25
             形态012路比 = 26	        26
             */
            _flotArr = [11,12,13,14,15,21,22,23,24,25,26];


        }else if(_lotterycode == 'qlc'){

            /**
             基本号码 = 11,	    11

             形态奇偶比    = 21,	    21
             形态大小比    = 22,	    22
             形态质合比    = 23,	    23
             形态012路比 = 24	    24
             形态和值       = 25	    25
             */
            _flotArr = [11,21,22,23,24,25];


        }else if(_lotterycode == 'qxc'){

            /**
             定位第一位 = 11,	    11
             定位第二位 = 12,	    12
             定位第三位 = 13,	    13
             定位第四位 = 14,	    14
             定位第五位 = 15,	    15
             定位第六位 = 16,	    16
             定位第七位 = 17,	    17

             形态大小比 = 21,	    21
             形态奇偶比 = 22,	    22
             形态质合比 = 23,	    23
             形态和值 = 24,	        24
             形态跨度 = 25,	        25
             形态012路比 = 26	    26
             */
            _flotArr = [11,12,13,14,15,16,17,20,21,22,23,24,25,26];

            /**  高频彩 */
        }else{

            if(/k3/.test(_lotterycode)){

                /**
                 基本一码 = 11,
                 基本二码 = 12,
                 基本和值 = 13,
                 基本跨度 = 14,
                 基本三同号012路 = 15,

                 二同号单选 = 20,
                 二同号二码 = 21,
                 二同号三码 = 22,
                 二同号二组 = 23,
                 二同号三组 = 24,
                 二同号和值 = 25,
                 二同号跨度 = 26,
                 二同号背靠背 = 27,
                 二同号形态    = 28,
                 二同号单选012路 = 29,

                 三不同号单选 = 31,
                 三不同号四码 = 32,
                 三不同号五码 = 33,
                 三不同号和值 = 34,
                 三不同号跨度 = 35,
                 三不同号012路 = 36,
                 三不同号二组 = 37,
                 三不同号三组 = 38,

                 三同号单选 = 41,
                 三同号二组 = 42,
                 三同号三组 = 43,
                 三同号四组 = 44,
                 三同号五组 = 45,
                 三同号通选 = 46
                 */
                _flotArr = [11,12,13,14,15,20,21,22,23,24,25,26,27,28,29,31,32,33,34,35,36,37,38,41,42,43,44,45,46];

            }else if(/kl10/.test(_lotterycode)  || _lotterycode=='xync'){



                if(_lotterycode == 'gxkl10'){

                    /**
                     基本一码 = 11,
                     基本二码 = 12,
                     基本三码 = 13,
                     基本四码 = 14,
                     基本五码 = 15,

                     形态大小比 = 21,
                     形态奇偶比 =22,
                     形态质合比 = 23,
                     形态012路 = 24

                     */

                    _flotArr = [11,12,13,14,15,21,22,23,24];

                }else{

                    /**
                     *   选一前一 = 11,

                     选二任选 = 21,
                     选二连组 = 22,
                     选二连直 = 23,

                     选三任选 = 31,
                     选三前组组选 = 32,
                     选三前组跨度 = 33,
                     选三前组和值 = 34,
                     选三前组大小比 = 35,
                     选三前组奇偶比 = 36,
                     选三前组质合比 = 37,
                     选三前组012路 = 38,
                     选三前直大小 = 39,
                     选三前直奇偶 = 40,
                     选三前直质合 = 41,
                     选三前直012路 = 42,

                     八码大小比 = 51,
                     八码奇偶比 = 52,
                     八码质合比 = 53,
                     八码012路 = 54,
                     八码跨度 = 55

                     */
                    _flotArr = [11,21,22,23,31,32,33,34,35,36,37,38,39,40,41,42,51,52,53,54,55];
                }


            }else if(/11x5/.test(_lotterycode)){

                /**
                 *  任一一码 = 101,
                 任二二码 = 102,
                 任二三码 = 103,
                 任二四码 = 104,
                 任三三码 = 105,
                 任三四码 = 106,
                 任三五码 = 107,
                 任四四码 = 108,
                 任四五码 = 109,
                 任四六码 = 110,
                 任四七码 = 111,
                 任五五码 = 112,
                 任五六码 = 113,
                 任五七码 = 114,
                 任五八码 = 115,
                 任五九码 = 116,
                 任五跨度 = 117,
                 任五和值 = 118,
                 任五奇偶 = 119,
                 任五大小 = 120,
                 任五质合 = 121,
                 任五除三余数 = 122,
                 任五三连号 = 123,
                 任五四连号 = 124,
                 任五五连号 = 125,
                 任六六码 = 126,
                 任六七码 = 127,
                 任六八码 = 128,
                 任六九码 = 129,
                 任七七码 = 130,
                 任七八码 = 131,
                 任七九码 = 132,
                 任八八码 = 133,
                 任八九码 = 134,

                 前一直选号码 = 201,
                 前一直选奇偶 = 202,
                 前一直选大小 = 203,
                 前一直选质合 = 204,
                 前一直选012路 = 205,
                 前二直选号码 = 206,
                 前二直选跨度 = 207,
                 前二直选和值 = 208,
                 前二直选奇偶 = 209,
                 前二直选大小 = 210,
                 前二直选质合 = 211,
                 前二直选012路 = 212,
                 二三位直选号码 = 213,
                 二三位直选跨度 = 214,
                 二三位直选和值 = 215,
                 二三位直选奇偶 = 216,
                 二三位直选大小 = 217,
                 二三位直选质合 = 218,
                 二三位直选012路 = 219,
                 一三位直选号码 = 220,
                 一三位直选跨度 = 221,
                 一三位直选和值 = 222,
                 一三位直选奇偶 = 223,
                 一三位直选大小 = 224,
                 一三位直选质合 = 225,
                 一三位直选012路 = 226,
                 前三直选号码 = 227,
                 前三直选跨度 = 228,
                 前三直选和值 = 229,
                 前三直选奇偶 = 230,
                 前三直选大小 = 231,
                 前三直选质合 = 232,
                 前三直选012路 = 233,


                 前二组选二码 = 301,
                 前二组选三码 = 302,
                 前二组选四码 = 303,
                 前二组选五码 = 304,
                 前二组选六码 = 305,
                 前二组选七码 = 306,
                 前二组选八码 = 307,
                 前二组选跨度 = 308,
                 前二组选和值 = 309,
                 前二组选奇偶比 = 310,
                 前二组选大小比 = 311,
                 前二组选质合比 = 312,
                 前二组选012路 = 313,
                 前三组选三码 = 314,
                 前三组选四码 = 315,
                 前三组选五码 = 316,
                 前三组选六码 = 317,
                 前三组选七码 = 318,
                 前三组选八码 = 319,
                 前三组选跨度 = 320,
                 前三组选和值 = 321,
                 前三组选奇偶比 = 322,
                 前三组选大小比 = 323,
                 前三组选质合比 = 324,
                 前三组选012路 = 325,

                 定位第一位号码 = 401,
                 定位第一位奇偶 = 402,
                 定位第一位大小 = 403,
                 定位第一位质合 = 404,
                 定位第一位012路 = 405,
                 定位第二位号码 = 406,
                 定位第二位奇偶 = 407,
                 定位第二位大小 = 408,
                 定位第二位质合 = 409,
                 定位第二位012路 = 410,
                 定位第三位号码 = 411,
                 定位第三位奇偶 = 412,
                 定位第三位大小 = 413,
                 定位第三位质合 = 414,
                 定位第三位012路 = 415,
                 定位第四位号码 = 416,
                 定位第四位奇偶 = 417,
                 定位第四位大小 = 418,
                 定位第四位质合 = 419,
                 定位第四位012路 = 420,
                 定位第五位号码 = 421,
                 定位第五位奇偶 = 422,
                 定位第五位大小 = 423,
                 定位第五位质合 = 424,
                 定位第五位012路 = 425
                 */

                _flotArr = [
                    101,102,103,104,105,106,107,108,109,110,
                    111,112,113,114,115,116,117,118,119,120,
                    121,122,123,124,125,126,127,128,129,130,
                    131,132,133,134,201,202,203,204,205,206,
                    207,208,209,210,211,212,213,214,215,216,
                    217,218,219,220,221,222,223,224,225,226,
                    227,228,229,230,231,232,233,301,302,303,
                    304,305,306,307,308,309,310,311,312,313,
                    314,315,316,317,318,319,320,321,322,323,
                    324,325,401,402,403,404,405,406,407,408,
                    409,410,411,412,413,414,415,416,417,418,
                    419,420,421,422,423,424,425
                ];

            }else if(/ssc/.test(_lotterycode)){

                /**
                 *  任一个位 = 11,
                 任一十位 = 12,
                 任一百位 = 13,
                 任一千位 = 14,
                 任一万位 = 15,
                 任二个十 = 16,
                 任二个百 = 17,
                 任二个千 = 18,
                 任二个万 = 19,
                 任二十百 = 20,
                 任二十千 = 21,
                 任二十万 = 22,
                 任二百千 = 23,
                 任二百万 = 24,
                 任二千万 = 25,

                 二星直选单式 = 51,
                 二星直选和值 = 52,
                 二星直选大小单双 = 53,
                 二星组选单式 = 54,
                 二星组选和值 = 55,
                 三星直选单式 = 56,
                 三星直选和值 = 57,
                 三星组三单式 = 58,
                 三星组三一码 = 59,
                 三星组三二码 = 60,
                 三星组三三码 = 61,
                 三星组三四码 = 62,
                 三星组三五码 = 63,
                 三星组三和值 = 64,
                 三星组三大小比 = 65,
                 三星组三奇偶比 = 66,
                 三星组三质合比 = 67,
                 三星组六单式 = 68,
                 三星组六四码 = 69,
                 三星组六五码 = 70,
                 三星组六和值 = 71,
                 三星组六大小比 = 72,
                 三星组六奇偶比 = 73,
                 三星组六质合比 = 74

                 */

                _flotArr = [
                    11,12,13,14,15,16,17,18,19,20,
                    21,22,23,24,25,51,52,53,54,55,
                    56,57,58,59,60,61,62,63,64,65,
                    66,67,68,69,70,71,72,73,74
                ];

            }

        }


        if( _flotType==undefined || typeof(_flotType) != 'number' ||  DealWithCommonService.contains(_flotArr, _flotType)== false){

            return this.errorMsg(`getMissFlotData: _flotType参数为空或不是数字类型, 或者是取值范围不正确！`);

        }

        let  cacheOpt = this.setCache(`${this.chartPath}/getFlotMissData`, 0);

        const httpOpt = {
            url: `${this.chartPath}/GetMissFlotData`,
            qs: {
                flotType: _flotType,
                number: _number,
                lotterycode: _lotterycode,
                type: _type
            }
        };

        return this.httpGet(httpOpt, cacheOpt);

    }


}