/*********************************************************************************************************
 *
 *                                              专家推荐分类配置
 *
 *********************************************************************************************************/
'use strict';
module.exports = {

    config:[{
        name: '福利彩票',
        id: 'digit',
        child: [
            {
                name: '双色球',
                id: 'ssq',
                child: [
                    {name: '22红+10蓝推荐', code: 101},
                    {name: '20红+8蓝推荐', code: 102},
                    {name: '18红+8蓝推荐', code: 103}
                ]
            },
            {
                name: '福彩3D',
                id: 'fc3d',
                child: [
                    {name: '七码组选推荐', code: 111},
                    {name: '六码组选推荐', code: 112},
                    {name: '五码组选推荐', code: 113},
                ]
            },{
                name: '七乐彩',
                id: 'qlc',
                child: [
                    {name: '二十码推荐', code: 121},
                    {name: '十八码推荐', code: 122},
                    {name: '十六码推荐', code: 123}
                ]
            }]

    },{
        name: '体育彩票',
        id: 'digit',
        child: [
            {
                name: '大乐透',
                id: 'dlt',
                child: [
                    {name: '22前+10后推荐', code: 131},
                    {name: '20前+8后推荐', code: 132},
                    {name: '18前+6后推荐', code: 133}
                ]
            },
            {
                name: '排列3',
                id: 'pl3',
                child: [
                    {name: '七码组选推荐', code: 111},
                    {name: '六码组选推荐', code: 112},
                    {name: '五码组选推荐', code: 113}
                ]
            }
        ]

    },{
        name: '高频彩票',
        id: 'high',
        child: []
    }]

}